---@class Init_cfg
---@field public id integer @唯一ID(必须为第一列且名称为id，类型为INT)
---@field public consumables_bag table @账户消耗品背包初始化拥有的内容<id,数量>
---@field public warehouse_bag table @账户仓库初始化拥有的内容<id,数量>
---@field public exp integer @经验值
---@field public collection integer[] @初始解锁图鉴
---@field public head integer @默认装备头像
---@field public head_box integer @默认装备头像框
---@field public title integer @默认装备称号
---@field public unlock_role integer[] @解锁角色
---@field public battle_role integer @出战角色
---@field public battle_ghost integer @出战鬼宠
---@field public named_item integer @改名卡道具ID
return {
[1] = { id=1,consumables_bag={[40030]=50,[40034]=20,[40035]=30,[40039]=20,[40040]=30,[40044]=50,[40050]=30,[40010]=20,[500013]=1},warehouse_bag={[1]=999999,[40030]=50,[40034]=30,[40035]=40,[40039]=30,[40040]=40,[40044]=50,[40050]=50,[41011]=20,[41052]=20,[41029]=6,[41035]=6,[41109]=8,[41130]=20,[44011]=4,[41062]=8,[41034]=4,[44016]=4,[41060]=10,[41008]=40,[44006]=4,[41115]=8,[41087]=20,[41028]=8,[40043]=5,[40049]=5,[500006]=1,[40047]=5,[500000]=1,[500012]=1,[40007]=10,[44021]=4,[40]=3600,[46517]=24,[43000]=5,[43109]=4,[43062]=4,[43139]=4,[43111]=4,[43007]=5,[43142]=4,[43061]=4,[43002]=6,[43054]=6,[43088]=4,[43140]=4,[43031]=6,[43005]=6,[43116]=3,[43063]=4,[43081]=5,[43006]=5,[43064]=4,[43143]=4,[43004]=7,[43107]=4,[43034]=4,[43065]=4,[43058]=6,[43080]=6,[43008]=4,[43138]=4,[43105]=4,[43033]=4,[43060]=4,[43010]=4,[102]=3,[104]=3,[106]=3,[108]=3,[7]=500},exp=0,collection={1015000,1015500,1016600},head=1015000,head_box=1015500,title=1016600,unlock_role={1000001,1000002,1000003,1000005},battle_role=1000003,battle_ghost=0,named_item=34012 }
}