---@class Init_cfg
---@field public id integer @唯一ID(必须为第一列且名称为id，类型为INT)
---@field public consumables_bag table @账户消耗品背包初始化拥有的内容<id,数量>
---@field public warehouse_bag table @账户仓库初始化拥有的内容<id,数量>
---@field public exp integer @经验值
---@field public head integer @头像
---@field public head_box integer @头像框
---@field public title integer @称号
---@field public unlock_role integer[] @解锁角色
---@field public battle_role integer @出战角色
---@field public battle_ghost integer @出战鬼宠
---@field public named_item integer @改名卡道具ID
return {
[1] = { id=1,consumables_bag={[40001]=1,[40002]=1,[40003]=1,[40004]=1,[40008]=3,[40015]=3,[40016]=1},warehouse_bag={[1]=999999,[41001]=30,[41002]=30,[41003]=30,[41004]=30,[41005]=30,[41006]=30,[41007]=30,[41008]=30,[41009]=30,[41010]=30,[41011]=30,[41012]=30,[41013]=30,[41014]=30,[41015]=30,[41016]=30,[41017]=30,[41018]=30,[41019]=30,[41020]=30,[41021]=30,[41022]=30,[22001]=30,[22002]=30,[22003]=30,[22004]=30,[22005]=30,[22006]=30,[21001]=30,[21002]=30,[21003]=30,[21004]=30,[21005]=30,[21006]=30,[23001]=30,[23002]=30,[23003]=30,[23004]=30,[23005]=30,[23006]=30,[24001]=30,[24002]=30,[24003]=30,[24004]=30,[24005]=30,[24006]=30,[20005]=30,[20010]=30,[600001]=1,[600501]=1,[601001]=1,[601502]=1,[603001]=1,[630000]=1,[630001]=1,[630002]=1,[630003]=1,[630004]=1,[630005]=1,[630006]=1,[630007]=1,[116000]=1,[116001]=1,[625000]=1,[625001]=1,[625006]=1,[34000]=30,[34001]=30,[34002]=30},exp=0,head=0,head_box=0,title=0,unlock_role={1000000,1000001,1000002,1000003,1000004},battle_role=1000003,battle_ghost=0,named_item=40001 }
}