---@class MaintenanceCost2_cfg
---@field public id integer @
---@field public type1 integer @八卦牌：1 法器：2 戒指：3
---@field public type2 integer @1.灰 2.白 3.蓝 4.紫 5.金 6.红 7.粉
---@field public sturdy_reset_count integer @坚固值恢复次数
---@field public cost1 table @第1次坚固值恢复消耗
---@field public cost2 table @第2次坚固值恢复消耗
---@field public cost3 table @第3次坚固值恢复消耗
---@field public cost4 table @第4次坚固值恢复消耗
---@field public cost5 table @第5次坚固值恢复消耗
---@field public cost6 table @第6次坚固值恢复消耗
---@field public cost7 table @第7次坚固值恢复消耗
---@field public cost8 table @第8次坚固值恢复消耗
---@field public cost9 table @第9次坚固值恢复消耗
---@field public cost10 table @第10次坚固值恢复消耗
---@field public cost11 table @第11次坚固值恢复消耗
---@field public cost12 table @第12次坚固值恢复消耗
---@field public cost13 table @第13次坚固值恢复消耗
---@field public cost14 table @第14次坚固值恢复消耗
---@field public cost15 table @第15次坚固值恢复消耗
---@field public cost16 table @第16次坚固值恢复消耗
---@field public cost17 table @第17次坚固值恢复消耗
---@field public cost18 table @第18次坚固值恢复消耗
---@field public cost19 table @第19次坚固值恢复消耗
---@field public cost20 table @第20次坚固值恢复消耗
return {
[1] = { id=1,type1=1,type2=2,sturdy_reset_count=20,cost1={[34995]=2},cost2={[34995]=2},cost3={[34995]=3},cost4={[34995]=3},cost5={[34995]=5},cost6={[34995]=5},cost7={[34995]=6},cost8={[34995]=6},cost9={[34995]=8},cost10={[34995]=8},cost11={[34995]=9},cost12={[34995]=9},cost13={[34995]=11},cost14={[34995]=11},cost15={[34995]=12},cost16={[34995]=12},cost17={[34995]=14},cost18={[34995]=14},cost19={[34995]=15},cost20={[34995]=15} },
[2] = { id=2,type1=1,type2=3,sturdy_reset_count=20,cost1={[34996]=2},cost2={[34996]=2},cost3={[34996]=3},cost4={[34996]=3},cost5={[34996]=5},cost6={[34996]=5},cost7={[34996]=6},cost8={[34996]=6},cost9={[34996]=8},cost10={[34996]=8},cost11={[34996]=9},cost12={[34996]=9},cost13={[34996]=11},cost14={[34996]=11},cost15={[34996]=12},cost16={[34996]=12},cost17={[34996]=14},cost18={[34996]=14},cost19={[34996]=15},cost20={[34996]=15} },
[3] = { id=3,type1=1,type2=4,sturdy_reset_count=20,cost1={[34997]=2},cost2={[34997]=2},cost3={[34997]=3},cost4={[34997]=3},cost5={[34997]=5},cost6={[34997]=5},cost7={[34997]=6},cost8={[34997]=6},cost9={[34997]=8},cost10={[34997]=8},cost11={[34997]=9},cost12={[34997]=9},cost13={[34997]=11},cost14={[34997]=11},cost15={[34997]=12},cost16={[34997]=12},cost17={[34997]=14},cost18={[34997]=14},cost19={[34997]=15},cost20={[34997]=15} },
[4] = { id=4,type1=1,type2=5,sturdy_reset_count=20,cost1={[34998]=2},cost2={[34998]=2},cost3={[34998]=3},cost4={[34998]=3},cost5={[34998]=5},cost6={[34998]=5},cost7={[34998]=6},cost8={[34998]=6},cost9={[34998]=8},cost10={[34998]=8},cost11={[34998]=9},cost12={[34998]=9},cost13={[34998]=11},cost14={[34998]=11},cost15={[34998]=12},cost16={[34998]=12},cost17={[34998]=14},cost18={[34998]=14},cost19={[34998]=15},cost20={[34998]=15} },
[5] = { id=5,type1=1,type2=6,sturdy_reset_count=20,cost1={[34999]=2},cost2={[34999]=2},cost3={[34999]=3},cost4={[34999]=3},cost5={[34999]=5},cost6={[34999]=5},cost7={[34999]=6},cost8={[34999]=6},cost9={[34999]=8},cost10={[34999]=8},cost11={[34999]=9},cost12={[34999]=9},cost13={[34999]=11},cost14={[34999]=11},cost15={[34999]=12},cost16={[34999]=12},cost17={[34999]=14},cost18={[34999]=14},cost19={[34999]=15},cost20={[34999]=15} },
[6] = { id=6,type1=2,type2=2,sturdy_reset_count=20,cost1={[34985]=2},cost2={[34985]=2},cost3={[34985]=3},cost4={[34985]=3},cost5={[34985]=5},cost6={[34985]=5},cost7={[34985]=6},cost8={[34985]=6},cost9={[34985]=8},cost10={[34985]=8},cost11={[34985]=9},cost12={[34985]=9},cost13={[34985]=11},cost14={[34985]=11},cost15={[34985]=12},cost16={[34985]=12},cost17={[34985]=14},cost18={[34985]=14},cost19={[34985]=15},cost20={[34985]=15} },
[7] = { id=7,type1=2,type2=3,sturdy_reset_count=20,cost1={[34986]=2},cost2={[34986]=2},cost3={[34986]=3},cost4={[34986]=3},cost5={[34986]=5},cost6={[34986]=5},cost7={[34986]=6},cost8={[34986]=6},cost9={[34986]=8},cost10={[34986]=8},cost11={[34986]=9},cost12={[34986]=9},cost13={[34986]=11},cost14={[34986]=11},cost15={[34986]=12},cost16={[34986]=12},cost17={[34986]=14},cost18={[34986]=14},cost19={[34986]=15},cost20={[34986]=15} },
[8] = { id=8,type1=2,type2=4,sturdy_reset_count=20,cost1={[34987]=2},cost2={[34987]=2},cost3={[34987]=3},cost4={[34987]=3},cost5={[34987]=5},cost6={[34987]=5},cost7={[34987]=6},cost8={[34987]=6},cost9={[34987]=8},cost10={[34987]=8},cost11={[34987]=9},cost12={[34987]=9},cost13={[34987]=11},cost14={[34987]=11},cost15={[34987]=12},cost16={[34987]=12},cost17={[34987]=14},cost18={[34987]=14},cost19={[34987]=15},cost20={[34987]=15} },
[9] = { id=9,type1=2,type2=5,sturdy_reset_count=20,cost1={[34988]=2},cost2={[34988]=2},cost3={[34988]=3},cost4={[34988]=3},cost5={[34988]=5},cost6={[34988]=5},cost7={[34988]=6},cost8={[34988]=6},cost9={[34988]=8},cost10={[34988]=8},cost11={[34988]=9},cost12={[34988]=9},cost13={[34988]=11},cost14={[34988]=11},cost15={[34988]=12},cost16={[34988]=12},cost17={[34988]=14},cost18={[34988]=14},cost19={[34988]=15},cost20={[34988]=15} },
[10] = { id=10,type1=2,type2=6,sturdy_reset_count=20,cost1={[34989]=2},cost2={[34989]=2},cost3={[34989]=3},cost4={[34989]=3},cost5={[34989]=5},cost6={[34989]=5},cost7={[34989]=6},cost8={[34989]=6},cost9={[34989]=8},cost10={[34989]=8},cost11={[34989]=9},cost12={[34989]=9},cost13={[34989]=11},cost14={[34989]=11},cost15={[34989]=12},cost16={[34989]=12},cost17={[34989]=14},cost18={[34989]=14},cost19={[34989]=15},cost20={[34989]=15} },
[11] = { id=11,type1=3,type2=2,sturdy_reset_count=20,cost1={[34985]=1},cost2={[34985]=1},cost3={[34985]=2},cost4={[34985]=2},cost5={[34985]=3},cost6={[34985]=3},cost7={[34985]=4},cost8={[34985]=4},cost9={[34985]=5},cost10={[34985]=5},cost11={[34985]=6},cost12={[34985]=6},cost13={[34985]=7},cost14={[34985]=7},cost15={[34985]=8},cost16={[34985]=8},cost17={[34985]=9},cost18={[34985]=9},cost19={[34985]=10},cost20={[34985]=10} },
[12] = { id=12,type1=3,type2=3,sturdy_reset_count=20,cost1={[34986]=1},cost2={[34986]=1},cost3={[34986]=2},cost4={[34986]=2},cost5={[34986]=3},cost6={[34986]=3},cost7={[34986]=4},cost8={[34986]=4},cost9={[34986]=5},cost10={[34986]=5},cost11={[34986]=6},cost12={[34986]=6},cost13={[34986]=7},cost14={[34986]=7},cost15={[34986]=8},cost16={[34986]=8},cost17={[34986]=9},cost18={[34986]=9},cost19={[34986]=10},cost20={[34986]=10} },
[13] = { id=13,type1=3,type2=4,sturdy_reset_count=20,cost1={[34987]=1},cost2={[34987]=1},cost3={[34987]=2},cost4={[34987]=2},cost5={[34987]=3},cost6={[34987]=3},cost7={[34987]=4},cost8={[34987]=4},cost9={[34987]=5},cost10={[34987]=5},cost11={[34987]=6},cost12={[34987]=6},cost13={[34987]=7},cost14={[34987]=7},cost15={[34987]=8},cost16={[34987]=8},cost17={[34987]=9},cost18={[34987]=9},cost19={[34987]=10},cost20={[34987]=10} },
[14] = { id=14,type1=3,type2=5,sturdy_reset_count=20,cost1={[34988]=1},cost2={[34988]=1},cost3={[34988]=2},cost4={[34988]=2},cost5={[34988]=3},cost6={[34988]=3},cost7={[34988]=4},cost8={[34988]=4},cost9={[34988]=5},cost10={[34988]=5},cost11={[34988]=6},cost12={[34988]=6},cost13={[34988]=7},cost14={[34988]=7},cost15={[34988]=8},cost16={[34988]=8},cost17={[34988]=9},cost18={[34988]=9},cost19={[34988]=10},cost20={[34988]=10} },
[15] = { id=15,type1=3,type2=6,sturdy_reset_count=20,cost1={[34989]=1},cost2={[34989]=1},cost3={[34989]=2},cost4={[34989]=2},cost5={[34989]=3},cost6={[34989]=3},cost7={[34989]=4},cost8={[34989]=4},cost9={[34989]=5},cost10={[34989]=5},cost11={[34989]=6},cost12={[34989]=6},cost13={[34989]=7},cost14={[34989]=7},cost15={[34989]=8},cost16={[34989]=8},cost17={[34989]=9},cost18={[34989]=9},cost19={[34989]=10},cost20={[34989]=10} }
}