---@class SeasonPassShopItemGroup_cfg
---@field public id integer @赛季通行证商店的物品组ID 通行证ID_第几个奖励(最大999)
---@field public unlock_cost integer @解锁所需的功德铢数量 需要在该通行证累计消耗x功德铢解锁
---@field public group integer[] @该页的物品/奖励ID 设计暂定每页9个奖励 玩家购买无顺序限制
return {
[1001] = { id=1001,unlock_cost=0,group={1,2,3,4,5,6,7,8,9} },
[1002] = { id=1002,unlock_cost=620,group={10,11,12,13,14,15,16,17,18} },
[1003] = { id=1003,unlock_cost=1370,group={19,20,21,22,23,24,25,26,27} },
[1004] = { id=1004,unlock_cost=2700,group={28,29,30,31,32,33,34,35,36} },
[1005] = { id=1005,unlock_cost=4500,group={37,38,39,40,41,42,43,44,45} },
[1006] = { id=1006,unlock_cost=6430,group={46,47,48,49,50,51,52,53,54} },
[1007] = { id=1007,unlock_cost=8560,group={55,56,57,58,59,60,61,62,63} },
[1008] = { id=1008,unlock_cost=10900,group={64,65,66,67,68,69,70,71,72} },
[1009] = { id=1009,unlock_cost=13710,group={73,74,75,76,77,78,79,80,81} },
[1010] = { id=1010,unlock_cost=16900,group={82,83,84,85,86,87,88,89,90} },
[2001] = { id=2001,unlock_cost=0,group={2001,2002,2003,2004,2005,2006,2007,2008,2009} },
[2002] = { id=2002,unlock_cost=2080,group={2010,2011,2012,2013,2014,2015,2016,2017,2018} },
[2003] = { id=2003,unlock_cost=4330,group={2019,2020,2021,2022,2023,2024,2025,2026,2027} },
[3001] = { id=3001,unlock_cost=0,group={3000,3001,3002,3003,3004,3005,3006,3007,3008} },
[3002] = { id=3002,unlock_cost=100,group={3010,3011,3012,3013,3014,3015,3016,3017,3018} }
}